In [ ]:
#Topics to cover for today
#label Encoder
#one Hot Encoder (using pd.get_dummies)
#Concatenate
#Append

In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [3]:
df=pd.read_csv('Mall_Customers_BP.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
#checking for null value
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [6]:
#applying label encoding techniques
encoder =LabelEncoder()
df['Genre']= encoder.fit_transform(df['Genre'])  #labeling according to alphabatical
df.head()

   CustomerID  Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1      1   19                  15                      39
1           2      1   21                  15                      81
2           3      0   20                  16                       6
3           4      0   23                  16                      77
4           5      0   31                  17                      40

In [7]:
df=pd.read_csv('Mall_Customers_BP.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [8]:
#One Hot Encoder with pd.get_dummies()
dummy_gender =pd.get_dummies(df['Genre'])
print(dummy_gender)

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         1     0
..      ...   ...
195       1     0
196       1     0
197       0     1
198       0     1
199       0     1

[200 rows x 2 columns]

In [9]:
#merginf the two dataframes
df=pd.merge(
left=df,
right=dummy_gender,
left_index=True,
right_index= True)
df.head()

,CustomerID,Genre,Age,Annual Income (k$),Spending Score (1-100),Female,Male
0,1,Male,19,15,39,0,1
1,2,Male,21,15,81,0,1
2,3,Female,20,16,6,1,0
3,4,Female,23,16,77,1,0
4,5,Female,31,17,40,1,0

In [12]:
# df.drop(['Genre'])
# df

In [15]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}
data2={
    'Name':['Rahul','Ayushi','Sharvari','Dhiraj'],
    'Age':[22,23,24,25],
    'Address':["Mumbai","Delhi",'Wardha',"Vizag"],
    'Qualification':['BE','BA','BCOM','BCA']
}
#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data2,index=[4,5,6,7])

#printng the dataset
print(df,'\n\n',df1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

        Name  Age Address Qualification
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [22]:

frames = [df, df1]

result = pd.concat([df, df1], ignore_index=True, sort=False)
result

       Name  Age Address Qualification
0    pranav   27  Nagpur            mE
1       Sai   28  Kanpur           MBA
2     Niraj   29  Satara           MSC
3     Vijay   30    Pune           BCA
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [23]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}
data2={
    'Name':['Rahul','Ayushi','Sharvari','Dhiraj'],
    'Age':[22,23,24,25],
    'Address':["Mumbai","Delhi",'Wardha',"Vizag"],
    'Qualification':['BE','BA','BCOM','BCA']
}
#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data2,index=[2,3,6,7])

#printng the dataset
print(df,'\n\n',df1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

        Name  Age Address Qualification
2     Rahul   22  Mumbai            BE
3    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [30]:
#concatenating with 'join' argument  concatenating data with same index number
res2=pd.concat([df,df1],axis=1,join='inner')
print(res2)

    Name  Age Address Qualification    Name  Age Address Qualification
2  Niraj   29  Satara           MSC   Rahul   22  Mumbai            BE
3  Vijay   30    Pune           BCA  Ayushi   23   Delhi            BA

In [29]:
#start argument in concatenating
res3=pd.concat([df,df1],axis=1,sort=False)
print(res3)

     Name   Age Address Qualification      Name   Age Address Qualification
0  pranav  27.0  Nagpur            mE       NaN   NaN     NaN           NaN
1     Sai  28.0  Kanpur           MBA       NaN   NaN     NaN           NaN
2   Niraj  29.0  Satara           MSC     Rahul  22.0  Mumbai            BE
3   Vijay  30.0    Pune           BCA    Ayushi  23.0   Delhi            BA
6     NaN   NaN     NaN           NaN  Sharvari  24.0  Wardha          BCOM
7     NaN   NaN     NaN           NaN    Dhiraj  25.0   Vizag           BCA

In [31]:
#start argument in concatenating
res3=pd.concat([df,df1],axis=1,sort=True)
print(res3)

     Name   Age Address Qualification      Name   Age Address Qualification
0  pranav  27.0  Nagpur            mE       NaN   NaN     NaN           NaN
1     Sai  28.0  Kanpur           MBA       NaN   NaN     NaN           NaN
2   Niraj  29.0  Satara           MSC     Rahul  22.0  Mumbai            BE
3   Vijay  30.0    Pune           BCA    Ayushi  23.0   Delhi            BA
6     NaN   NaN     NaN           NaN  Sharvari  24.0  Wardha          BCOM
7     NaN   NaN     NaN           NaN    Dhiraj  25.0   Vizag           BCA

In [32]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}
data2={
    'Name':['Rahul','Ayushi','Sharvari','Dhiraj'],
    'Age':[22,23,24,25],
    'Address':["Mumbai","Delhi",'Wardha',"Vizag"],
    'Qualification':['BE','BA','BCOM','BCA']
}
#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data2,index=[4,5,6,7])

#printng the dataset
print(df,'\n\n',df1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

        Name  Age Address Qualification
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [33]:
#using append function
res=df.append(df1)
print(res)

       Name  Age Address Qualification
0    pranav   27  Nagpur            mE
1       Sai   28  Kanpur           MBA
2     Niraj   29  Satara           MSC
3     Vijay   30    Pune           BCA
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [34]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}
data2={
    'Name':['Rahul','Ayushi','Sharvari','Dhiraj'],
    'Age':[22,23,24,25],
    'Address':["Mumbai","Delhi",'Wardha',"Vizag"],
    'Qualification':['BE','BA','BCOM','BCA']
}
#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data2,index=[2,3,6,7])

#printng the dataset
print(df,'\n\n',df1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

        Name  Age Address Qualification
2     Rahul   22  Mumbai            BE
3    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [35]:
#ignore_ndex argument
res=pd.concat([df,df1],ignore_index=True)
print(res)

       Name  Age Address Qualification
0    pranav   27  Nagpur            mE
1       Sai   28  Kanpur           MBA
2     Niraj   29  Satara           MSC
3     Vijay   30    Pune           BCA
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [36]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}
data2={
    'Name':['Rahul','Ayushi','Sharvari','Dhiraj'],
    'Age':[22,23,24,25],
    'Address':["Mumbai","Delhi",'Wardha',"Vizag"],
    'Qualification':['BE','BA','BCOM','BCA']
}
#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])
df1=pd.DataFrame(data2,index=[4,5,6,7])

#printng the dataset
print(df,'\n\n',df1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

        Name  Age Address Qualification
4     Rahul   22  Mumbai            BE
5    Ayushi   23   Delhi            BA
6  Sharvari   24  Wardha          BCOM
7    Dhiraj   25   Vizag           BCA

In [37]:
#concatenating using key
frames=[df,df1]
res=pd.concat(frames,keys=['x','y'])
print(res)

         Name  Age Address Qualification
x 0    pranav   27  Nagpur            mE
  1       Sai   28  Kanpur           MBA
  2     Niraj   29  Satara           MSC
  3     Vijay   30    Pune           BCA
y 4     Rahul   22  Mumbai            BE
  5    Ayushi   23   Delhi            BA
  6  Sharvari   24  Wardha          BCOM
  7    Dhiraj   25   Vizag           BCA

In [39]:
#creating the dataset
data1={
    'Name':['pranav','Sai','Niraj','Vijay'],
    'Age':[27,28,29,30],
    'Address':["Nagpur","Kanpur",'Satara',"Pune"],
    'Qualification':['mE','MBA','MSC','BCA']
}

#converting the dictionaries to dataframes
df=pd.DataFrame(data1,index=[0,1,2,3])


#creating a series
s1=pd.Series([1000,2000,3000,4000],name='Salary')
print(df,'\n\n',s1)

     Name  Age Address Qualification
0  pranav   27  Nagpur            mE
1     Sai   28  Kanpur           MBA
2   Niraj   29  Satara           MSC
3   Vijay   30    Pune           BCA

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

In [40]:
#concatenating a dataframe and a series
res=pd.concat([df,s1],axis=1)
print(res)

     Name  Age Address Qualification  Salary
0  pranav   27  Nagpur            mE    1000
1     Sai   28  Kanpur           MBA    2000
2   Niraj   29  Satara           MSC    3000
3   Vijay   30    Pune           BCA    4000

In [44]:
#checking the datatype of dataframe
res.dtypes

Name             object
Age                int8
Address          object
Qualification    object
Salary            int64
dtype: object

In [45]:
#changing/converting int64 to int8
res['Age']=res['Age'].astype(np.int8)
res.dtypes

Name             object
Age                int8
Address          object
Qualification    object
Salary            int64
dtype: object

In [47]:
#converting int64 to float64
res['Salary']=res['Salary'].astype(float)
res.dtypes

Name              object
Age                 int8
Address           object
Qualification     object
Salary           float64
dtype: object

In [48]:
#concatenating a dataframe and a series
res=pd.concat([df,s1],axis=1)
print(res)

     Name  Age Address Qualification  Salary
0  pranav   27  Nagpur            mE    1000
1     Sai   28  Kanpur           MBA    2000
2   Niraj   29  Satara           MSC    3000
3   Vijay   30    Pune           BCA    4000

In [50]:
#converting multiple columns
res[['Age','Salary']]=res[['Age','Salary']].astype(float)
print(res)

     Name   Age Address Qualification  Salary
0  pranav  27.0  Nagpur            mE  1000.0
1     Sai  28.0  Kanpur           MBA  2000.0
2   Niraj  29.0  Satara           MSC  3000.0
3   Vijay  30.0    Pune           BCA  4000.0

In [51]:
res.dtypes

Name              object
Age              float64
Address           object
Qualification     object
Salary           float64
dtype: object

In [52]:
res=pd.concat([df,s1],axis=1)
print(res)

     Name  Age Address Qualification  Salary
0  pranav   27  Nagpur            mE    1000
1     Sai   28  Kanpur           MBA    2000
2   Niraj   29  Satara           MSC    3000
3   Vijay   30    Pune           BCA    4000

In [56]:
#using downcast argumnet
res['Age']=pd.to_numeric(res['Age'],downcast='float')
print(res)
print(res.dtypes)

     Name   Age Address Qualification  Salary
0  pranav  27.0  Nagpur            mE    1000
1     Sai  28.0  Kanpur           MBA    2000
2   Niraj  29.0  Satara           MSC    3000
3   Vijay  30.0    Pune           BCA    4000
Name              object
Age              float32
Address           object
Qualification     object
Salary             int64
dtype: object

In [57]:
res['Salary']=pd.to_numeric(res['Salary'],downcast='float')
print(res)
print(res.dtypes)

     Name   Age Address Qualification  Salary
0  pranav  27.0  Nagpur            mE  1000.0
1     Sai  28.0  Kanpur           MBA  2000.0
2   Niraj  29.0  Satara           MSC  3000.0
3   Vijay  30.0    Pune           BCA  4000.0
Name              object
Age              float32
Address           object
Qualification     object
Salary           float32
dtype: object